SAR-mango/SinESC/Old/Dev/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F2xx motor 2.h
/* Inrush current limiter */
#if (INRUSH_CURRLIMIT_ENABLING2 != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef INRUSH_CURRLIMIT_GPIO_PORT2
  #undef INRUSH_CURRLIMIT_GPIO_PIN2
  
  #define INRUSH_CURRLIMIT_GPIO_PORT2  GPIOD
  #define INRUSH_CURRLIMIT_GPIO_PIN2   GPIO_Pin_10
#endif

/* Current sensing topology */
#if (defined(SINGLE_SHUNT2))
  /* Dummy value to avoid compiler error */
  #undef PHASE_U_CURR_ADC2
  #undef PHASE_U_CURR_CHANNEL2
  #undef PHASE_U_GPIO_PORT2
  #undef PHASE_U_GPIO_PIN2
  #undef PHASE_V_CURR_ADC2
  #undef PHASE_V_CURR_CHANNEL2
  #undef PHASE_V_GPIO_PORT2
  #undef PHASE_V_GPIO_PIN2
  #undef PHASE_W_CURR_ADC2
  #undef PHASE_W_CURR_CHANNEL2
  #undef PHASE_W_GPIO_PORT2
  #undef PHASE_W_GPIO_PIN2
  
  #define PHASE_U_CURR_ADC2                ADC1_2
  #define PHASE_U_CURR_CHANNEL2            ADC_Channel_11
  #define PHASE_U_GPIO_PORT2               GPIOC
  #define PHASE_U_GPIO_PIN2                GPIO_Pin_1
  #define PHASE_V_CURR_ADC2                ADC1_2
  #define PHASE_V_CURR_CHANNEL2            ADC_Channel_12
  #define PHASE_V_GPIO_PORT2               GPIOC
  #define PHASE_V_GPIO_PIN2                GPIO_Pin_2
  #define PHASE_W_CURR_ADC2                ADC1_2
  #define PHASE_W_CURR_CHANNEL2            ADC_Channel_13
  #define PHASE_W_GPIO_PORT2               GPIOC
  #define PHASE_W_GPIO_PIN2                GPIO_Pin_3
#elif (defined(ICS_SENSORS2))
  /* Dummy value to avoid compiler error */
  #undef PHASE_W_CURR_ADC2
  #undef PHASE_W_CURR_CHANNEL2
  #undef PHASE_W_GPIO_PORT2
  #undef PHASE_W_GPIO_PIN2
  
  #define PHASE_W_CURR_ADC2                ADC1_2
  #define PHASE_W_CURR_CHANNEL2            ADC_Channel_13
  #define PHASE_W_GPIO_PORT2               GPIOC
  #define PHASE_W_GPIO_PIN2                GPIO_Pin_3
  
  #undef PHASE_CURRENTS_ADC2
  #undef PHASE_CURRENTS_CHANNEL2
  #undef PHASE_CURRENTS_GPIO_PORT2
  #undef PHASE_CURRENTS_GPIO_PIN2
  
  #define PHASE_CURRENTS_ADC2              ADC3
  #define PHASE_CURRENTS_CHANNEL2          ADC_Channel_12
  #define PHASE_CURRENTS_GPIO_PORT2        GPIOC
  #define PHASE_CURRENTS_GPIO_PIN2         GPIO_Pin_2
#else
  /* Dummy value to avoid compiler error */
  #undef PHASE_CURRENTS_ADC2
  #undef PHASE_CURRENTS_CHANNEL2
  #undef PHASE_CURRENTS_GPIO_PORT2
  #undef PHASE_CURRENTS_GPIO_PIN2
  
  #define PHASE_CURRENTS_ADC2              ADC3
  #define PHASE_CURRENTS_CHANNEL2          ADC_Channel_12
  #define PHASE_CURRENTS_GPIO_PORT2        GPIOC
  #define PHASE_CURRENTS_GPIO_PIN2         GPIO_Pin_2
#endif

#if (TEMPERATURE_READING2 != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef TEMP_FDBK_GPIO_PORT2
  #undef TEMP_FDBK_GPIO_PIN2
  #define TEMP_FDBK_GPIO_PORT2             GPIOA
  #define TEMP_FDBK_GPIO_PIN2              GPIO_Pin_1
#endif

#if (BUS_VOLTAGE_READING2 != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef VBUS_GPIO_PORT2
  #undef VBUS_GPIO_PIN2
  #define VBUS_GPIO_PORT2                  GPIOA
  #define VBUS_GPIO_PIN2                   GPIO_Pin_1
#endif

#if ((defined HALL_SENSORS2) || (defined AUX_HALL_SENSORS2))
#if (HALL_TIMER_SELECTION2 == HALL_TIM2)
#define SPD_TIM_M2_IRQHandler TIM2_IRQHandler
#elif (HALL_TIMER_SELECTION2 == HALL_TIM3)
#define SPD_TIM_M2_IRQHandler TIM3_IRQHandler
#elif (HALL_TIMER_SELECTION2 == HALL_TIM4)
#define SPD_TIM_M2_IRQHandler TIM4_IRQHandler
#elif (HALL_TIMER_SELECTION2 == HALL_TIM5)
#define SPD_TIM_M2_IRQHandler TIM5_IRQHandler
#else
#endif
#endif

#if ((defined ENCODER2) || (defined AUX_ENCODER2))
#if (ENC_TIMER_SELECTION2 == ENC_TIM2)
#define SPD_TIM_M2_IRQHandler TIM2_IRQHandler
#elif (ENC_TIMER_SELECTION2 == ENC_TIM3)
#define SPD_TIM_M2_IRQHandler TIM3_IRQHandler
#elif (ENC_TIMER_SELECTION2 == ENC_TIM4)
#define SPD_TIM_M2_IRQHandler TIM4_IRQHandler
#elif (ENC_TIMER_SELECTION2 == ENC_TIM5)
#define SPD_TIM_M2_IRQHandler TIM5_IRQHandler
#else
#endif
#endif

#if (HALL_ICx_FILTER2 <= 1)
#define HALL_IC_FILTER2   0
#elif (HALL_ICx_FILTER2 <= 2)
#define HALL_IC_FILTER2   1
#elif (HALL_ICx_FILTER2 <= 6)
#define HALL_IC_FILTER2   2
#elif (HALL_ICx_FILTER2 <= 10)
#define HALL_IC_FILTER2   3
#elif (HALL_ICx_FILTER2 <= 14)
#define HALL_IC_FILTER2   4
#elif (HALL_ICx_FILTER2 <= 20)
#define HALL_IC_FILTER2   5
#elif (HALL_ICx_FILTER2 <= 28)
#define HALL_IC_FILTER2   6
#elif (HALL_ICx_FILTER2 <= 40)
#define HALL_IC_FILTER2   7
#elif (HALL_ICx_FILTER2 <= 56)
#define HALL_IC_FILTER2   8
#elif (HALL_ICx_FILTER2 <= 72)
#define HALL_IC_FILTER2   9
#elif (HALL_ICx_FILTER2 <= 88)
#define HALL_IC_FILTER2   10
#elif (HALL_ICx_FILTER2 <= 112)
#define HALL_IC_FILTER2   11
#elif (HALL_ICx_FILTER2 <= 144)
#define HALL_IC_FILTER2   12
#elif (HALL_ICx_FILTER2 <= 176)
#define HALL_IC_FILTER2   13
#elif (HALL_ICx_FILTER2 <= 224)
#define HALL_IC_FILTER2   14
#else
#define HALL_IC_FILTER2   15
#endif

#if (ENC_ICx_FILTER2 == 0)
#define ENC_IC_FILTER2   0
#elif (ENC_ICx_FILTER2 <= 2)
#define ENC_IC_FILTER2   1
#elif (ENC_ICx_FILTER2 <= 6)
#define ENC_IC_FILTER2   2
#elif (ENC_ICx_FILTER2 <= 10)
#define ENC_IC_FILTER2   3
#elif (ENC_ICx_FILTER2 <= 14)
#define ENC_IC_FILTER2   4
#elif (ENC_ICx_FILTER2 <= 20)
#define ENC_IC_FILTER2   5
#elif (ENC_ICx_FILTER2 <= 28)
#define ENC_IC_FILTER2   6
#elif (ENC_ICx_FILTER2 <= 40)
#define ENC_IC_FILTER2   7
#elif (ENC_ICx_FILTER2 <= 56)
#define ENC_IC_FILTER2   8
#elif (ENC_ICx_FILTER2 <= 72)
#define ENC_IC_FILTER2   9
#elif (ENC_ICx_FILTER2 <= 88)
#define ENC_IC_FILTER2   10
#elif (ENC_ICx_FILTER2 <= 112)
#define ENC_IC_FILTER2   11
#elif (ENC_ICx_FILTER2 <= 144)
#define ENC_IC_FILTER2   12
#elif (ENC_ICx_FILTER2 <= 176)
#define ENC_IC_FILTER2   13
#elif (ENC_ICx_FILTER2 <= 224)
#define ENC_IC_FILTER2   14
#else
#define ENC_IC_FILTER2   15
#endif

/*************** Encoder Alignemnt ************************/
    
/* Encoder alignment */
#define T_ALIGNMENT2             ALIGNMENT_DURATION2
#define ALIGNMENT_ANGLE_S162      (int16_t)  (ALIGNMENT_ANGLE_DEG2*65536u/360u)

/*************** Timer for PWM generation & currenst sensing parameters  ******/
#define PWM_PERIOD_CYCLES2 (uint16_t)(ADV_TIM_CLK_MHz*\
                                      (unsigned long long)1000000u/((uint16_t)(PWM_FREQUENCY2)))

#if ((LOW_SIDE_SIGNALS_ENABLING2 == ENABLE)||(LOW_SIDE_SIGNALS_ENABLING2 == LS_PWM_TIMER_VAL))
#define DEADTIME_NS2  SW_DEADTIME_NS2
#else
#define DEADTIME_NS2  HW_DEAD_TIME_NS2
#endif

#define DEAD_TIME_ADV_TIM_CLK_MHz2 (ADV_TIM_CLK_MHz2 * TIM_CLOCK_DIVIDER2)
#define DEAD_TIME_COUNTS2_1  (DEAD_TIME_ADV_TIM_CLK_MHz2 * DEADTIME_NS2/1000uL)

#if (DEAD_TIME_COUNTS2_1 <= 255)
  #define DEAD_TIME_COUNTS2 (uint16_t) DEAD_TIME_COUNTS2_1
#elif (DEAD_TIME_COUNTS2_1 <= 508)
  #define DEAD_TIME_COUNTS2 (uint16_t)(((DEAD_TIME_ADV_TIM_CLK_MHz2 * DEADTIME_NS2/2) /1000uL) + 128)
  #elif (DEAD_TIME_COUNTS2_1 <= 1008)
    #define DEAD_TIME_COUNTS2 (uint16_t)(((DEAD_TIME_ADV_TIM_CLK_MHz2 * DEADTIME_NS2/8) /1000uL) + 320)
    #elif (DEAD_TIME_COUNTS2_1 <= 2015)
      #define DEAD_TIME_COUNTS2 (uint16_t)(((DEAD_TIME_ADV_TIM_CLK_MHz2 * DEADTIME_NS2/16) /1000uL) + 384)
      #else
        #define DEAD_TIME_COUNTS2 510
#endif

