SAR-mango/SinESC/Old/Dev/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F2xx motor 2.h
#define DTCOMPCNT2 (uint16_t)((DEADTIME_NS2 * ADV_TIM_CLK_MHz2) / 2000)
#define TON_NS2  500
#define TOFF_NS2 500
#define TON2  (uint16_t)((TON_NS2 * ADV_TIM_CLK_MHz2)  / 2000)
#define TOFF2 (uint16_t)((TOFF_NS2 * ADV_TIM_CLK_MHz2) / 2000)

#if (TNOISE_NS2 > TRISE_NS2)
  #define MAX_TNTR_NS2 TNOISE_NS2
#else
  #define MAX_TNTR_NS2 TRISE_NS2
#endif


#define SAMPLING_TIME_NS2 (((CURR_SAMPLING_TIME2) * 1000uL/ADC_CLK_MHz2)+(7000uL/(2*ADC_CLK_MHz2)))

/* Sampling time allowed for F2xx are: 3, 15, 28, 56, 84, 112, 144, 480 ADC clock cycle */    
#if (CURR_SAMPLING_TIME2 == 3)
#define SAMPLING_TIME_SEL2 ADC_SampleTime_3Cycles  
#elif (CURR_SAMPLING_TIME2 == 15)
#define SAMPLING_TIME_SEL2  ADC_SampleTime_15Cycles
#elif (CURR_SAMPLING_TIME2 == 28)
#define SAMPLING_TIME_SEL2  ADC_SampleTime_28Cycles
#elif (CURR_SAMPLING_TIME2 == 56)
#define SAMPLING_TIME_SEL2  ADC_SampleTime_56Cycles
#elif (CURR_SAMPLING_TIME2 == 84)
#define SAMPLING_TIME_SEL2  ADC_SampleTime_84Cycles
#elif (CURR_SAMPLING_TIME2 == 112)
#define SAMPLING_TIME_SEL2  ADC_SampleTime_112Cycles
#elif (CURR_SAMPLING_TIME2 == 144)
#define SAMPLING_TIME_SEL2  ADC_SampleTime_144Cycles
#elif (CURR_SAMPLING_TIME2 == 480)
#define SAMPLING_TIME_SEL2  ADC_SampleTime_480Cycles
#else
#if defined(DUALDRIVE)
#warning "CURR_SAMPLING_TIME2 not allowed"
#endif
#endif

#define SAMPLING_TIME2 (uint16_t)(((uint16_t)(SAMPLING_TIME_NS2) * ADV_TIM_CLK_MHz2)/1000uL) 
#define TRISE2 (uint16_t)((((uint16_t)(TRISE_NS2)) * ADV_TIM_CLK_MHz2)/1000uL)
#define TDEAD2 (uint16_t)((DEADTIME_NS2 * ADV_TIM_CLK_MHz2)/1000uL)

#define TMIN2 (((uint16_t)(((DEADTIME_NS2+((uint16_t)(TRISE_NS2))+\
              ((uint16_t)(SAMPLING_TIME_NS2)))*ADV_TIM_CLK_MHz2)/1000ul))+1)
#define HTMIN2 (uint16_t)(TMIN2 >> 1)
#define TSAMPLE2 SAMPLING_TIME2
#define TAFTER2 ((uint16_t)(((DEADTIME_NS2+((uint16_t)(TRISE_NS2)))\
                                                     *ADV_TIM_CLK_MHz2)/1000ul))
#define TBEFORE2 (((uint16_t)(((((uint16_t)(SAMPLING_TIME_NS2)))\
                                                  *ADV_TIM_CLK_MHz2)/1000ul))+1)

#if (TRISE_NS2 > SAMPLING_TIME_NS2)
  #define MAX_TRTS2 (2 * TRISE2)
#else
  #define MAX_TRTS2 (2 * SAMPLING_TIME2)
#endif

#define TNOISE2 (u16)((((u16)(TNOISE_NS2)) * ADV_TIM_CLK_MHz2)/1000uL)

#if (TNOISE_NS2 > TRISE_NS2)
  #define MAX_TNTR_NS2 TNOISE_NS2
#else
  #define MAX_TNTR_NS2 TRISE_NS2
#endif

#define TW_AFTER2 ((uint16_t)(((DEADTIME_NS2+MAX_TNTR_NS2)*ADV_TIM_CLK_MHz2)/1000ul))
#define TW_BEFORE2 (((uint16_t)(((((uint16_t)(SAMPLING_TIME_NS2)))*ADV_TIM_CLK_MHz2)/1000ul))+1u)


#ifdef THREE_SHUNT2
#define MAX_TWAIT (uint16_t)((TW_AFTER2 - SAMPLING_TIME2)/2)
#else //ICS or One shunt
#define MAX_TWAIT 0
#endif

#ifdef THREE_SHUNT
#define MAX_TWAIT2 (uint16_t)((TW_AFTER - SAMPLING_TIME)/2)
#else //ICS or One shunt
#define MAX_TWAIT2 0
#endif

#if (FLUX_WEAKENING_ENABLING2 == ENABLE)
#define FLUX_WEAKENING2
#endif
#if (MTPA_ENABLING2 == ENABLE)
#define IPMSM_MTPA2
#endif
#if (FEED_FORWARD_CURRENT_REG_ENABLING2 == ENABLE)
#define FEED_FORWARD_CURRENT_REGULATION2
#endif

#ifdef MAX_MODULATION_81_PER_CENT2
#define START_INDEX2     41
#define MAX_MODULE2      26541   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*81% 
#define MMITABLE2 {\
32508,32255,32008,31530,31299,30852,30636,30216,30012,29617,29426,29053,28872,\
28520,28349,28015,27853,27536,27382,27081,26934,26647,26507,26234,26101,25840,\
25712,25462,25340,25101,24984,24755,24643,24422,24315,24103,24000,23796,23696,\
23500,23404,23216,23123,22941,22851,22763,22589,22504,22336,22253,22091,22011,\
21854,21776,21624,21549,21401,21329,21186,21115,20976,20908,20773,20706,20575,\
20511,20383,20320,20196,20135,20015,19955,19838,19780,19666,19609,19498,19443,\
19334,19280,19175,19122,19019,18968,18867,18817,18719\
}
#endif

#ifdef MAX_MODULATION_83_PER_CENT2
#define START_INDEX2     44
#define MAX_MODULE2      27196   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*83% 
#define MMITABLE2 {\
32291,32060,31613,31397,30977,30573,30377,29996,29811,29451,29276,28934,28768,\
28444,28286,27978,27827,27533,27390,27110,26973,26705,26574,26318,26069,25948,\
25709,25592,25363,25251,25031,24923,24711,24607,24404,24304,24107,24011,23821,\
23728,23545,23456,23279,23192,23021,22854,22772,22610,22530,22374,22297,22145,\
22070,21922,21850,21707,21636,21497,21429,21294,21227,21096,21032,20904,20778,\
20717,20595,20534,20416,20357,20241,20184,20071,20015,19905,19851,19743,19690,\
19585,19533,19431,19380,19280,19182\
}
#endif


#ifdef MAX_MODULATION_85_PER_CENT2
#define START_INDEX2     46
#define MAX_MODULE2      27851   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*85%  
#define MMITABLE2 {\
32324,32109,31691,31489,31094,30715,30530,30170,29995,29654,29488,29163,29005,\
28696,28397,28250,27965,27825,27552,27418,27157,26903,26779,26535,26416,26182,\
26067,25842,25623,25515,25304,25201,24997,24897,24701,24605,24415,24230,24139,\
23960,23872,23699,23614,23446,23282,23201,23042,22964,22810,22734,22584,22437,\
22365,22223,22152,22014,21945,21811,21678,21613,21484,21421,21296,21234,21112,\
21051,20932,20815,20757,20643,20587,20476,20421,20312,20205,20152,20048,19996\
,19894,19844,19744,19645\
}
#endif



#ifdef MAX_MODULATION_87_PER_CENT2
#define START_INDEX2     48
#define MAX_MODULE2      28507   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*87%  
#define MMITABLE2 {\
32559,32154,31764,31575,31205,31025,30674,30335,30170,29847,\
29689,29381,29083,28937,28652,28375,28239,27974,27844,27589,\
27342,27220,26983,26866,26637,26414,26305,26090,25984,25777,\
25575,25476,25280,25184,24996,24811,24720,24542,24367,24281,\
24112,24028,23864,23703,23624,23468,23391,23240,23091,23018,\
22874,22803,22662,22524,22456,22322,22191,22126,21997,21934,\
21809,21686,21625,21505,21446,21329,21214,21157,21045,20990,\
20880,20772,20719,20613,20561,20458,20356,20306,20207,20158,\
20109\
}
#endif

#ifdef MAX_MODULATION_89_PER_CENT2
#define START_INDEX2     50
#define MAX_MODULE2      29162   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*89%
#define MMITABLE2 {\
32574,32197,32014,31656,31309,31141,30811,30491,30335,30030,\
29734,29589,29306,29031,28896,28632,28375,28249,28002,27881,\
27644,27412,27299,27076,26858,26751,26541,26336,26235,26037,\
25844,25748,25561,25378,25288,25110,24936,24851,24682,24517,\
24435,24275,24118,24041,23888,23738,23664,23518,23447,23305,\
23166,23097,22962,22828,22763,22633,22505,22442,22318,22196,\
22135,22016,21898,21840,21726,21613,21557,21447,21338,21284,\
21178,21074,21022,20919,20819,20769,20670,20573\
}
#endif

#ifdef MAX_MODULATION_91_PER_CENT2
#define START_INDEX2     52
#define MAX_MODULE2      29817   // root(Vd^2+Vq^2) <= MAX_MODULE = 32767*91%
#define MMITABLE2 {\
32588,32411,32066,31732,31569,31250,30940,30789,30492,30205,\
29925,29788,29519,29258,29130,28879,28634,28395,28278,28048,\
27823,27713,27497,27285,27181,26977,26777,26581,26485,26296,\
26110,26019,25840,25664,25492,25407,25239,25076,24995,24835,\
24679,24602,24450,24301,24155,24082,23940,23800,23731,23594,\
23460,23328,23263,23135,23008,22946,22822,22701,22641,22522,\
22406,22291,22234,22122,22011,21956,21848,21741,21636,21584,\
21482,21380,21330,21231,21133,21037\
}
#endif


